; domain
(define (domain snowman_basic_adl)

    (:requirements
        :typing
        :negative-preconditions
        :equality
        :disjunctive-preconditions
        :conditional-effects
        :action-costs
    )

    (:types
        location direction ball size - object
    )

    (:predicates
        (snow ?l - location)
        (next ?from ?to - location ?dir - direction)
        (occupancy ?l - location)
        (character_at ?l - location)
        (ball_at ?b - ball ?l - location)
        (ball_size_small ?b - ball)
        (ball_size_medium ?b - ball)
        (ball_size_large ?b - ball)
        (goal)
   )

    (:functions
        (total-cost) - number
    )

    (:action move_character

     :parameters
       (?from ?to - location ?dir - direction)

     :precondition
        (and
            (next ?from ?to ?dir)
            (character_at ?from)
            (not (occupancy ?to)))

     :effect
        (and
            (not (character_at ?from))
            (character_at ?to))
    )

    (:action move_ball

     :parameters
        (?b - ball ?ppos ?from ?to - location ?dir - direction)

     :precondition
        (and
            (next ?ppos ?from ?dir)
            (next ?from ?to ?dir)
            (ball_at ?b ?from)
            (character_at ?ppos)
            (forall (?o - ball)
                (or
                    (= ?o ?b)
                    (or
                        (not (ball_at ?o ?from))
                        (or
                            (and
                                (ball_size_small ?b)
                                (ball_size_medium ?o))
                            (and
                                (ball_size_small ?b)
                                (ball_size_large ?o))
                            (and
                                (ball_size_medium ?b)
                                (ball_size_large ?o))))))
            (or
                (forall (?o - ball)
                    (or
                        (= ?o ?b)
                        (not (ball_at ?o ?from))))
                (forall (?o - ball)
                        (not (ball_at ?o ?to))))
            (forall (?o - ball)
                    (or
                        (not (ball_at ?o ?to))
                        (or
                            (and
                                (ball_size_small ?b)
                                (ball_size_medium ?o))
                            (and
                                (ball_size_small ?b)
                                (ball_size_large ?o))
                            (and
                                (ball_size_medium ?b)
                                (ball_size_large ?o))))))
     :effect
        (and
            (occupancy ?to)
            (not (ball_at ?b ?from))
            (ball_at ?b ?to)
            (when
                (forall (?o - ball)
                    (or
                        (= ?o ?b)
                        (not (ball_at ?o ?from))))
                (and
                    (not (character_at ?ppos))
                    (character_at ?from)
                    (not (occupancy ?from))))
            (not (snow ?to))
            (when
                (and
                    (snow ?to)
                    (ball_size_small ?b))
                (and
                    (not (ball_size_small ?b))
                    (ball_size_medium ?b)))
            (when
                (and
                    (snow ?to)
                    (ball_size_medium ?b))
                (and
                    (not (ball_size_medium ?b))
                    (ball_size_large ?b)))
            (increase (total-cost) 1))
    )

    (:action goal

     :parameters
        (?b0 ?b1 ?b2 - ball ?p0 - location)

     :precondition
        (and
            (not (= ?b0 ?b1))
            (not (= ?b0 ?b2))
            (not (= ?b1 ?b2))
            (ball_at ?b0 ?p0)
            (ball_at ?b1 ?p0)
            (ball_at ?b2 ?p0)
        )

     :effect
         (and (goal))
    )
)

; problem
(define (problem priscilla)

    (:domain snowman_basic_adl)

    (:objects
        right - direction
        left - direction
        up - direction
        down - direction
        ball_0 - ball
        ball_1 - ball
        ball_2 - ball
        loc_1_2 - location
        loc_1_3 - location
        loc_1_4 - location
        loc_1_5 - location
        loc_2_1 - location
        loc_2_2 - location
        loc_2_3 - location
        loc_2_4 - location
        loc_2_5 - location
        loc_3_1 - location
        loc_3_2 - location
        loc_4_1 - location
        loc_4_2 - location
        loc_5_1 - location
        loc_5_2 - location
        loc_6_1 - location
        loc_6_2 - location
        loc_6_3 - location
        loc_6_4 - location
        loc_6_5 - location
        loc_7_2 - location
        loc_7_3 - location
        loc_7_4 - location
        loc_7_5 - location
    )

    (:init
        (= (total-cost) 0)
        (next loc_1_2 loc_2_2 right)
        (next loc_1_2 loc_1_3 up)
        (next loc_1_3 loc_2_3 right)
        (next loc_1_3 loc_1_4 up)
        (next loc_1_3 loc_1_2 down)
        (next loc_1_4 loc_2_4 right)
        (next loc_1_4 loc_1_5 up)
        (next loc_1_4 loc_1_3 down)
        (next loc_1_5 loc_2_5 right)
        (next loc_1_5 loc_1_4 down)
        (next loc_2_1 loc_3_1 right)
        (next loc_2_1 loc_2_2 up)
        (next loc_2_2 loc_3_2 right)
        (next loc_2_2 loc_1_2 left)
        (next loc_2_2 loc_2_3 up)
        (next loc_2_2 loc_2_1 down)
        (next loc_2_3 loc_1_3 left)
        (next loc_2_3 loc_2_4 up)
        (next loc_2_3 loc_2_2 down)
        (next loc_2_4 loc_1_4 left)
        (next loc_2_4 loc_2_5 up)
        (next loc_2_4 loc_2_3 down)
        (next loc_2_5 loc_1_5 left)
        (next loc_2_5 loc_2_4 down)
        (next loc_3_1 loc_4_1 right)
        (next loc_3_1 loc_2_1 left)
        (next loc_3_1 loc_3_2 up)
        (next loc_3_2 loc_4_2 right)
        (next loc_3_2 loc_2_2 left)
        (next loc_3_2 loc_3_1 down)
        (next loc_4_1 loc_5_1 right)
        (next loc_4_1 loc_3_1 left)
        (next loc_4_1 loc_4_2 up)
        (next loc_4_2 loc_5_2 right)
        (next loc_4_2 loc_3_2 left)
        (next loc_4_2 loc_4_1 down)
        (next loc_5_1 loc_6_1 right)
        (next loc_5_1 loc_4_1 left)
        (next loc_5_1 loc_5_2 up)
        (next loc_5_2 loc_6_2 right)
        (next loc_5_2 loc_4_2 left)
        (next loc_5_2 loc_5_1 down)
        (next loc_6_1 loc_5_1 left)
        (next loc_6_1 loc_6_2 up)
        (next loc_6_2 loc_7_2 right)
        (next loc_6_2 loc_5_2 left)
        (next loc_6_2 loc_6_3 up)
        (next loc_6_2 loc_6_1 down)
        (next loc_6_3 loc_7_3 right)
        (next loc_6_3 loc_6_4 up)
        (next loc_6_3 loc_6_2 down)
        (next loc_6_4 loc_7_4 right)
        (next loc_6_4 loc_6_5 up)
        (next loc_6_4 loc_6_3 down)
        (next loc_6_5 loc_7_5 right)
        (next loc_6_5 loc_6_4 down)
        (next loc_7_2 loc_6_2 left)
        (next loc_7_2 loc_7_3 up)
        (next loc_7_3 loc_6_3 left)
        (next loc_7_3 loc_7_4 up)
        (next loc_7_3 loc_7_2 down)
        (next loc_7_4 loc_6_4 left)
        (next loc_7_4 loc_7_5 up)
        (next loc_7_4 loc_7_3 down)
        (next loc_7_5 loc_6_5 left)
        (next loc_7_5 loc_7_4 down)
        (character_at loc_4_1)
        (ball_at ball_0 loc_2_2)
        (ball_size_small ball_0)
        (ball_at ball_1 loc_4_2)
        (ball_size_small ball_1)
        (ball_at ball_2 loc_6_2)
        (ball_size_small ball_2)
        (snow loc_1_2)
        (snow loc_1_3)
        (snow loc_1_4)
        (snow loc_1_5)
        (snow loc_2_1)
        (snow loc_2_3)
        (snow loc_2_4)
        (snow loc_2_5)
        (snow loc_3_1)
        (snow loc_3_2)
        (snow loc_4_1)
        (snow loc_5_1)
        (snow loc_5_2)
        (snow loc_6_1)
        (snow loc_6_3)
        (snow loc_6_4)
        (snow loc_6_5)
        (snow loc_7_2)
        (snow loc_7_3)
        (snow loc_7_4)
        (snow loc_7_5)
        (occupancy loc_2_2)
        (occupancy loc_4_2)
        (occupancy loc_6_2)
    )

    (:goal
        (and (goal))
    )

    (:metric minimize (total-cost))
)

; plan
1. (move_character loc_4_1 loc_3_1 left)
   deleted: (character_at loc_4_1)
   added: (character_at loc_3_1)
   goals met: 0 of 1
2. (move_character loc_3_1 loc_2_1 left)
   deleted: (character_at loc_3_1)
   added: (character_at loc_2_1)
   goals met: 0 of 1
3. (move_ball ball_0 loc_2_1 loc_2_2 loc_2_3 up)
   deleted: (ball_at ball_0 loc_2_2) (character_at loc_2_1) (occupancy loc_2_2) (snow loc_2_3) (ball_size_small ball_0)
   added: (occupancy loc_2_3) (ball_at ball_0 loc_2_3) (character_at loc_2_2) (ball_size_medium ball_0)
   goals met: 0 of 1
4. (move_character loc_2_2 loc_1_2 left)
   deleted: (character_at loc_2_2)
   added: (character_at loc_1_2)
   goals met: 0 of 1
5. (move_character loc_1_2 loc_1_3 up)
   deleted: (character_at loc_1_2)
   added: (character_at loc_1_3)
   goals met: 0 of 1
6. (move_character loc_1_3 loc_1_4 up)
   deleted: (character_at loc_1_3)
   added: (character_at loc_1_4)
   goals met: 0 of 1
7. (move_character loc_1_4 loc_2_4 right)
   deleted: (character_at loc_1_4)
   added: (character_at loc_2_4)
   goals met: 0 of 1
8. (move_ball ball_0 loc_2_4 loc_2_3 loc_2_2 down)
   deleted: (ball_at ball_0 loc_2_3) (character_at loc_2_4) (occupancy loc_2_3)
   added: (occupancy loc_2_2) (ball_at ball_0 loc_2_2) (character_at loc_2_3)
   goals met: 0 of 1
9. (move_character loc_2_3 loc_1_3 left)
   deleted: (character_at loc_2_3)
   added: (character_at loc_1_3)
   goals met: 0 of 1
10. (move_character loc_1_3 loc_1_2 down)
   deleted: (character_at loc_1_3)
   added: (character_at loc_1_2)
   goals met: 0 of 1
11. (move_ball ball_0 loc_1_2 loc_2_2 loc_3_2 right)
   deleted: (ball_at ball_0 loc_2_2) (character_at loc_1_2) (occupancy loc_2_2) (snow loc_3_2) (ball_size_medium ball_0)
   added: (occupancy loc_3_2) (ball_at ball_0 loc_3_2) (character_at loc_2_2) (ball_size_large ball_0)
   goals met: 0 of 1
12. (move_character loc_2_2 loc_2_1 down)
   deleted: (character_at loc_2_2)
   added: (character_at loc_2_1)
   goals met: 0 of 1
13. (move_character loc_2_1 loc_3_1 right)
   deleted: (character_at loc_2_1)
   added: (character_at loc_3_1)
   goals met: 0 of 1
14. (move_character loc_3_1 loc_4_1 right)
   deleted: (character_at loc_3_1)
   added: (character_at loc_4_1)
   goals met: 0 of 1
15. (move_character loc_4_1 loc_5_1 right)
   deleted: (character_at loc_4_1)
   added: (character_at loc_5_1)
   goals met: 0 of 1
16. (move_character loc_5_1 loc_5_2 up)
   deleted: (character_at loc_5_1)
   added: (character_at loc_5_2)
   goals met: 0 of 1
17. (move_ball ball_1 loc_5_2 loc_4_2 loc_3_2 left)
   deleted: (ball_at ball_1 loc_4_2) (character_at loc_5_2) (occupancy loc_4_2)
   added: (ball_at ball_1 loc_3_2) (character_at loc_4_2)
   goals met: 0 of 1
18. (move_ball ball_1 loc_4_2 loc_3_2 loc_2_2 left)
   deleted: (ball_at ball_1 loc_3_2)
   added: (occupancy loc_2_2) (ball_at ball_1 loc_2_2)
   goals met: 0 of 1
19. (move_character loc_4_2 loc_4_1 down)
   deleted: (character_at loc_4_2)
   added: (character_at loc_4_1)
   goals met: 0 of 1
20. (move_character loc_4_1 loc_3_1 left)
   deleted: (character_at loc_4_1)
   added: (character_at loc_3_1)
   goals met: 0 of 1
21. (move_character loc_3_1 loc_2_1 left)
   deleted: (character_at loc_3_1)
   added: (character_at loc_2_1)
   goals met: 0 of 1
22. (move_ball ball_1 loc_2_1 loc_2_2 loc_2_3 up)
   deleted: (ball_at ball_1 loc_2_2) (character_at loc_2_1) (occupancy loc_2_2)
   added: (occupancy loc_2_3) (ball_at ball_1 loc_2_3) (character_at loc_2_2)
   goals met: 0 of 1
23. (move_ball ball_0 loc_2_2 loc_3_2 loc_4_2 right)
   deleted: (ball_at ball_0 loc_3_2) (character_at loc_2_2) (occupancy loc_3_2)
   added: (occupancy loc_4_2) (ball_at ball_0 loc_4_2) (character_at loc_3_2)
   goals met: 0 of 1
24. (move_ball ball_0 loc_3_2 loc_4_2 loc_5_2 right)
   deleted: (ball_at ball_0 loc_4_2) (character_at loc_3_2) (occupancy loc_4_2) (snow loc_5_2)
   added: (occupancy loc_5_2) (ball_at ball_0 loc_5_2) (character_at loc_4_2)
   goals met: 0 of 1
25. (move_character loc_4_2 loc_4_1 down)
   deleted: (character_at loc_4_2)
   added: (character_at loc_4_1)
   goals met: 0 of 1
26. (move_character loc_4_1 loc_5_1 right)
   deleted: (character_at loc_4_1)
   added: (character_at loc_5_1)
   goals met: 0 of 1
27. (move_character loc_5_1 loc_6_1 right)
   deleted: (character_at loc_5_1)
   added: (character_at loc_6_1)
   goals met: 0 of 1
28. (move_ball ball_2 loc_6_1 loc_6_2 loc_6_3 up)
   deleted: (ball_at ball_2 loc_6_2) (character_at loc_6_1) (occupancy loc_6_2) (snow loc_6_3) (ball_size_small ball_2)
   added: (occupancy loc_6_3) (ball_at ball_2 loc_6_3) (character_at loc_6_2) (ball_size_medium ball_2)
   goals met: 0 of 1
29. (move_character loc_6_2 loc_7_2 right)
   deleted: (character_at loc_6_2)
   added: (character_at loc_7_2)
   goals met: 0 of 1
30. (move_character loc_7_2 loc_7_3 up)
   deleted: (character_at loc_7_2)
   added: (character_at loc_7_3)
   goals met: 0 of 1
31. (move_character loc_7_3 loc_7_4 up)
   deleted: (character_at loc_7_3)
   added: (character_at loc_7_4)
   goals met: 0 of 1
32. (move_character loc_7_4 loc_6_4 left)
   deleted: (character_at loc_7_4)
   added: (character_at loc_6_4)
   goals met: 0 of 1
33. (move_ball ball_2 loc_6_4 loc_6_3 loc_6_2 down)
   deleted: (ball_at ball_2 loc_6_3) (character_at loc_6_4) (occupancy loc_6_3)
   added: (occupancy loc_6_2) (ball_at ball_2 loc_6_2) (character_at loc_6_3)
   goals met: 0 of 1
34. (move_character loc_6_3 loc_7_3 right)
   deleted: (character_at loc_6_3)
   added: (character_at loc_7_3)
   goals met: 0 of 1
35. (move_character loc_7_3 loc_7_2 down)
   deleted: (character_at loc_7_3)
   added: (character_at loc_7_2)
   goals met: 0 of 1
36. (move_ball ball_2 loc_7_2 loc_6_2 loc_5_2 left)
   deleted: (ball_at ball_2 loc_6_2) (character_at loc_7_2) (occupancy loc_6_2)
   added: (ball_at ball_2 loc_5_2) (character_at loc_6_2)
   goals met: 0 of 1
37. (move_character loc_6_2 loc_6_1 down)
   deleted: (character_at loc_6_2)
   added: (character_at loc_6_1)
   goals met: 0 of 1
38. (move_character loc_6_1 loc_5_1 left)
   deleted: (character_at loc_6_1)
   added: (character_at loc_5_1)
   goals met: 0 of 1
39. (move_character loc_5_1 loc_4_1 left)
   deleted: (character_at loc_5_1)
   added: (character_at loc_4_1)
   goals met: 0 of 1
40. (move_character loc_4_1 loc_3_1 left)
   deleted: (character_at loc_4_1)
   added: (character_at loc_3_1)
   goals met: 0 of 1
41. (move_character loc_3_1 loc_2_1 left)
   deleted: (character_at loc_3_1)
   added: (character_at loc_2_1)
   goals met: 0 of 1
42. (move_character loc_2_1 loc_2_2 up)
   deleted: (character_at loc_2_1)
   added: (character_at loc_2_2)
   goals met: 0 of 1
43. (move_character loc_2_2 loc_1_2 left)
   deleted: (character_at loc_2_2)
   added: (character_at loc_1_2)
   goals met: 0 of 1
44. (move_character loc_1_2 loc_1_3 up)
   deleted: (character_at loc_1_2)
   added: (character_at loc_1_3)
   goals met: 0 of 1
45. (move_character loc_1_3 loc_1_4 up)
   deleted: (character_at loc_1_3)
   added: (character_at loc_1_4)
   goals met: 0 of 1
46. (move_character loc_1_4 loc_2_4 right)
   deleted: (character_at loc_1_4)
   added: (character_at loc_2_4)
   goals met: 0 of 1
47. (move_ball ball_1 loc_2_4 loc_2_3 loc_2_2 down)
   deleted: (ball_at ball_1 loc_2_3) (character_at loc_2_4) (occupancy loc_2_3)
   added: (occupancy loc_2_2) (ball_at ball_1 loc_2_2) (character_at loc_2_3)
   goals met: 0 of 1
48. (move_character loc_2_3 loc_1_3 left)
   deleted: (character_at loc_2_3)
   added: (character_at loc_1_3)
   goals met: 0 of 1
49. (move_character loc_1_3 loc_1_2 down)
   deleted: (character_at loc_1_3)
   added: (character_at loc_1_2)
   goals met: 0 of 1
50. (move_ball ball_1 loc_1_2 loc_2_2 loc_3_2 right)
   deleted: (ball_at ball_1 loc_2_2) (character_at loc_1_2) (occupancy loc_2_2)
   added: (occupancy loc_3_2) (ball_at ball_1 loc_3_2) (character_at loc_2_2)
   goals met: 0 of 1
51. (move_ball ball_1 loc_2_2 loc_3_2 loc_4_2 right)
   deleted: (ball_at ball_1 loc_3_2) (character_at loc_2_2) (occupancy loc_3_2)
   added: (occupancy loc_4_2) (ball_at ball_1 loc_4_2) (character_at loc_3_2)
   goals met: 0 of 1
52. (move_ball ball_1 loc_3_2 loc_4_2 loc_5_2 right)
   deleted: (ball_at ball_1 loc_4_2) (character_at loc_3_2) (occupancy loc_4_2)
   added: (ball_at ball_1 loc_5_2) (character_at loc_4_2)
   goals met: 0 of 1
53. (goal ball_0 ball_1 ball_2 loc_5_2)
   added: (goal)
   goals met: 1 of 1
